apache/nuttx/arch/arm/src/common/stm32/stm32_can_m3m4_v1.c
/****************************************************************************
 * arch/arm/src/common/stm32/stm32_can_m3m4_v1.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <inttypes.h>
#include <stdio.h>
#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <arch/board/board.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/can/can.h>

#include "arm_internal.h"
#include "chip.h"
#include "stm32.h"
#include "stm32_rcc.h"
#include "stm32_can.h"

#if defined(CONFIG_CAN) && \
    (defined(CONFIG_STM32_CAN1) || defined(CONFIG_STM32_CAN2))

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Delays *******************************************************************/

/* Time out for INAK bit */

#define INAK_TIMEOUT 65535

/* Bit timing ***************************************************************/

#define CAN_BIT_QUANTA (CONFIG_STM32_CAN_TSEG1 + CONFIG_STM32_CAN_TSEG2 + 1)

#ifndef CONFIG_DEBUG_CAN_INFO
#  undef CONFIG_STM32_CAN_REGDEBUG
#endif

/* CAN error interrupts */

#ifdef CONFIG_CAN_ERRORS
#  define STM32_CAN_ERRINT (CAN_IER_LECIE | CAN_IER_ERRIE |             \
                            CAN_IER_BOFIE | CAN_IER_EPVIE |             \
                            CAN_IER_EWGIE)
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct stm32_can_s
{
  uint8_t  port;     /* CAN port number (1 or 2) */
  uint8_t  canrx[2]; /* CAN RX FIFO 0/1 IRQ number */
  uint8_t  cantx;    /* CAN TX IRQ number */
#ifdef CONFIG_CAN_ERRORS
  uint8_t  cansce;   /* CAN SCE IRQ number */
#endif
  uint8_t  filter;   /* Filter number */
  uint32_t base;     /* Base address of the CAN control registers */
  uint32_t fbase;    /* Base address of the CAN filter registers */
  uint32_t baud;     /* Configured baud */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* CAN Register access */

static uint32_t stm32can_getreg(struct stm32_can_s *priv,
                                int offset);
static uint32_t stm32can_getfreg(struct stm32_can_s *priv,
                                 int offset);
static void stm32can_putreg(struct stm32_can_s *priv, int offset,
                            uint32_t value);
static void stm32can_putfreg(struct stm32_can_s *priv, int offset,
                             uint32_t value);
#ifdef CONFIG_STM32_CAN_REGDEBUG
static void stm32can_dumpctrlregs(struct stm32_can_s *priv,
                                  const char *msg);
static void stm32can_dumpmbregs(struct stm32_can_s *priv,
                                const char *msg);
static void stm32can_dumpfiltregs(struct stm32_can_s *priv,
                                  const char *msg);
#else
#  define stm32can_dumpctrlregs(priv,msg)
#  define stm32can_dumpmbregs(priv,msg)
#  define stm32can_dumpfiltregs(priv,msg)
#endif

/* Filtering (todo) */

#ifdef CONFIG_CAN_EXTID
static int  stm32can_addextfilter(struct stm32_can_s *priv,
                                  struct canioc_extfilter_s *arg);
static int  stm32can_delextfilter(struct stm32_can_s *priv,
                                  int arg);
#endif
static int  stm32can_addstdfilter(struct stm32_can_s *priv,
                                  struct canioc_stdfilter_s *arg);
static int  stm32can_delstdfilter(struct stm32_can_s *priv,
                                  int arg);

/* CAN driver methods */

static void stm32can_reset(struct can_dev_s *dev);
static int  stm32can_setup(struct can_dev_s *dev);
static void stm32can_shutdown(struct can_dev_s *dev);
static void stm32can_rxint(struct can_dev_s *dev, bool enable);
static void stm32can_txint(struct can_dev_s *dev, bool enable);
static int  stm32can_ioctl(struct can_dev_s *dev, int cmd,
                           unsigned long arg);
static int  stm32can_remoterequest(struct can_dev_s *dev,
                                   uint16_t id);
static int  stm32can_send(struct can_dev_s *dev,
                          struct can_msg_s *msg);
static bool stm32can_txready(struct can_dev_s *dev);
static bool stm32can_txempty(struct can_dev_s *dev);

#ifdef CONFIG_CAN_ERRORS
static void stm32can_errint(struct can_dev_s *dev, bool enable);
#endif

/* CAN interrupt handling */

static int  stm32can_rxinterrupt(struct can_dev_s *dev, int rxmb);
static int  stm32can_rx0interrupt(int irq, void *context, void *arg);
static int  stm32can_rx1interrupt(int irq, void *context, void *arg);
static int  stm32can_txinterrupt(int irq, void *context, void *arg);
#ifdef CONFIG_CAN_ERRORS
static int  stm32can_sceinterrupt(int irq, void *context, void *arg);
#endif

/* Initialization */

