apache/nuttx/arch/arm/src/common/stm32/stm32_can_m3m4_v1.c
static int stm32can_rx0interrupt(int irq, void *context, void *arg)
{
  struct can_dev_s *dev = (struct can_dev_s *)arg;
  return stm32can_rxinterrupt(dev, 0);
}

/****************************************************************************
 * Name: stm32can_rx1interrupt
 *
 * Description:
 *   CAN RX FIFO 1 interrupt handler
 *
 * Input Parameters:
 *   irq - The IRQ number of the interrupt.
 *   context - The register state save array at the time of the interrupt.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int stm32can_rx1interrupt(int irq, void *context, void *arg)
{
  struct can_dev_s *dev = (struct can_dev_s *)arg;
  return stm32can_rxinterrupt(dev, 1);
}

/****************************************************************************
 * Name: stm32can_txinterrupt
 *
 * Description:
 *   CAN TX mailbox complete interrupt handler
 *
 * Input Parameters:
 *   irq - The IRQ number of the interrupt.
 *   context - The register state save array at the time of the interrupt.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int stm32can_txinterrupt(int irq, void *context, void *arg)
{
  struct can_dev_s *dev = (struct can_dev_s *)arg;
  struct stm32_can_s *priv;
  uint32_t regval;

  DEBUGASSERT(dev != NULL && dev->cd_priv != NULL);
  priv = dev->cd_priv;

  /* Get the transmit status */

  regval = stm32can_getreg(priv, STM32_CAN_TSR_OFFSET);

  /* Check for RQCP0: Request completed mailbox 0 */

  if ((regval & CAN_TSR_RQCP0) != 0)
    {
      /* Writing '1' to RCP0 clears RCP0 and all the status bits (TXOK0,
       * ALST0 and TERR0) for Mailbox 0.
       */

      stm32can_putreg(priv, STM32_CAN_TSR_OFFSET, CAN_TSR_RQCP0);

      /* Tell the upper half that the transfer is finished. */

      can_txdone(dev);
    }

  /* Check for RQCP1: Request completed mailbox 1 */

  if ((regval & CAN_TSR_RQCP1) != 0)
    {
      /* Writing '1' to RCP1 clears RCP1 and all the status bits (TXOK1,
       * ALST1 and TERR1) for Mailbox 1.
       */

      stm32can_putreg(priv, STM32_CAN_TSR_OFFSET, CAN_TSR_RQCP1);

      /* Tell the upper half that the transfer is finished. */

      can_txdone(dev);
    }

  /* Check for RQCP2: Request completed mailbox 2 */

  if ((regval & CAN_TSR_RQCP2) != 0)
    {
      /* Writing '1' to RCP2 clears RCP2 and all the status bits (TXOK2,
       * ALST2 and TERR2) for Mailbox 2.
       */

      stm32can_putreg(priv, STM32_CAN_TSR_OFFSET, CAN_TSR_RQCP2);

      /* Tell the upper half that the transfer is finished. */

      can_txdone(dev);
    }

  return OK;
}

#ifdef CONFIG_CAN_ERRORS
/****************************************************************************
 * Name: stm32can_sceinterrupt
 *
 * Description:
 *   CAN status change interrupt handler
 *
 * Input Parameters:
 *   irq - The IRQ number of the interrupt.
 *   context - The register state save array at the time of the interrupt.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int stm32can_sceinterrupt(int irq, void *context, void *arg)
{
  struct can_dev_s   *dev     = (struct can_dev_s *)arg;
  struct stm32_can_s *priv    = NULL;
  struct can_hdr_s    hdr;
  uint32_t            regval  = 0;
  uint16_t            errbits = 0;
  uint8_t             data[CAN_ERROR_DLC];
  int                 ret     = OK;

  DEBUGASSERT(dev != NULL && dev->cd_priv != NULL);
  priv = dev->cd_priv;

  /* Check Error Interrupt flag */

  regval = stm32can_getreg(priv, STM32_CAN_MSR_OFFSET);
  if (regval & CAN_MSR_ERRI)
    {
      /* Encode error bits */

      errbits = 0;
      memset(data, 0, sizeof(data));

      /* Get Error statur register */

      regval = stm32can_getreg(priv, STM32_CAN_ESR_OFFSET);

      if (regval & CAN_ESR_EWGF)
        {
          /* Error warning flag */

          data[1] |= (CAN_ERROR1_RXWARNING | CAN_ERROR1_TXWARNING);
          errbits |= CAN_ERROR_CONTROLLER;
        }

      if (regval & CAN_ESR_EPVF)
        {
          /* Error passive flag */

          data[1] |= (CAN_ERROR1_RXPASSIVE | CAN_ERROR1_TXPASSIVE);
          errbits |= CAN_ERROR_CONTROLLER;
        }

      if (regval & CAN_ESR_BOFF)
        {
          /* Bus-off flag */

          errbits |= CAN_ERROR_BUSOFF;
        }

      /* Last error code */

      if (regval & CAN_ESR_LEC_MASK)
        {
          if (regval & CAN_ESR_STUFFERROR)
            {
              /* Stuff Error */

              errbits |= CAN_ERROR_PROTOCOL;
              data[2] |= CAN_ERROR2_STUFF;
            }
          else if (regval & CAN_ESR_FORMERROR)
            {
              /* Format Error */

              errbits |= CAN_ERROR_PROTOCOL;
              data[2] |= CAN_ERROR2_FORM;
            }
          else if (regval & CAN_ESR_ACKERROR)
            {
              /* Acknowledge Error */

              errbits |= CAN_ERROR_NOACK;
            }
          else if (regval & CAN_ESR_BRECERROR)
            {
              /* Bit recessive Error */

              errbits |= CAN_ERROR_PROTOCOL;
              data[2] |= CAN_ERROR2_BIT1;
            }
          else if (regval & CAN_ESR_BDOMERROR)
            {
              /* Bit dominant Error */

              errbits |= CAN_ERROR_PROTOCOL;
              data[2] |= CAN_ERROR2_BIT0;
            }
          else if (regval & CAN_ESR_CRCERRPR)
            {
              /* Receive CRC Error */

              errbits |= CAN_ERROR_PROTOCOL;
              data[3] |= CAN_ERROR3_CRCSEQ;
            }
        }

      /* Get transmit status register */

      regval = stm32can_getreg(priv, STM32_CAN_TSR_OFFSET);

      if (regval & CAN_TSR_ALST0 || regval & CAN_TSR_ALST1 ||
          regval & CAN_TSR_ALST2)
        {
          /* Lost arbitration Error */

          errbits |= CAN_ERROR_LOSTARB;
        }

      /* Clear TSR register */

      stm32can_putreg(priv, STM32_CAN_TSR_OFFSET, regval);

